prepositions_1 = ["من", "إلى", "عن", "على", "في"]
prepositions_2 = ["من", "إلى", "عن", "على", "في", "ب", "ك", "ل"]
prepositions_single_letters = ["ب", "ك", "ل"]

prep_letter_example_and_rule_dict = {"ب":"إذا كان حرف الجر هو : ب، فالإجابة الصحيحة هي  حرف الجر المتصل بالكلمة المجرورة التي تليه.",
                                "ل": "إذا كان حرف الجر هو : ل، فالإجابة الصحيحة هي  حرف الجر المتصل بالكلمة المجرورة التي تليه.",
                                "ك": "إذا كان حرف الجر هو : ك، فالإجابة الصحيحة هي  حرف الجر المتصل بالكلمة المجرورة التي تليه."}
